outputs/qwen38-27b-fp8_pro5000_8x72g_input-4k-output-1k_cand4_baseline/results/c002/bench_c1_20260830-111338.log
$ python -m sglang.bench_serving --backend sglang --host 127.0.0.1 --port 30002 --model /data/models/Qwen3.8-27B-FP8/ --dataset-name random-ids --random-input-len 4096 --random-output-len 1024 --random-range-ratio 1.0 --max-concurrency 1 --num-prompts 4 --output-file /workspace/outputs/c002/bench_c1_20260830-111338.jsonl
# exit code: 0

----- stdout -----
benchmark_args=Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=30002, ready_check_timeout_sec=60, dataset_name='random-ids', dataset_path='', dataset_offset=0, agentic_max_turns=None, speed_bench_category=None, speed_bench_output_len=512, model='/data/models/Qwen3.8-27B-FP8/', served_model_name=None, tokenizer=None, num_prompts=4, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=4096, random_output_len=1024, random_range_ratio=1.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=1, output_file='/workspace/outputs/c002/bench_c1_20260830-111338.jsonl', output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, cache_report=False, seed=42, disable_ignore_eos=False, temperature=0.0, top_p=1.0, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, gsp_group_distribution='uniform', gsp_zipf_alpha=None, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', fake_prefill=False, tag=None, header=None)
Waiting up to 60s for http://127.0.0.1:30002/v1/models to become ready...
Server ready in 0.0s.
Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=30002, ready_check_timeout_sec=60, dataset_name='random-ids', dataset_path='', dataset_offset=0, agentic_max_turns=None, speed_bench_category=None, speed_bench_output_len=512, model='/data/models/Qwen3.8-27B-FP8/', served_model_name=None, tokenizer=None, num_prompts=4, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=4096, random_output_len=1024, random_range_ratio=1.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=1, output_file='/workspace/outputs/c002/bench_c1_20260830-111338.jsonl', output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, cache_report=False, seed=42, disable_ignore_eos=False, temperature=0.0, top_p=1.0, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, gsp_group_distribution='uniform', gsp_zipf_alpha=None, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', fake_prefill=False, tag=None, header=None)

#Input tokens: 16384
#Output tokens: 4096
Starting warmup with 1 sequences...
Warmup completed with 1 sequences. Starting main benchmark run...

============ Serving Benchmark Result ============
Backend:                                 sglang    
Traffic request rate:                    inf       
Max request concurrency:                 1         
Successful requests:                     4         
Benchmark duration (s):                  56.25     
Total input tokens:                      16384     
Total input text tokens:                 16384     
Total generated tokens:                  4096      
Total generated tokens (retokenized):    4096      
Request throughput (req/s):              0.07      
Input token throughput (tok/s):          291.25    
Output token throughput (tok/s):         72.81     
Peak output token throughput (tok/s):    76.00     
Peak concurrent requests:                2         
Total token throughput (tok/s):          364.06    
Concurrency:                             1.00      
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   14059.09  
Median E2E Latency (ms):                 14059.18  
P90 E2E Latency (ms):                    14061.22  
P95 E2E Latency (ms):                    14061.30  
P99 E2E Latency (ms):                    14061.36  
---------------Time to First Token----------------
Mean TTFT (ms):                          453.44    
Median TTFT (ms):                        453.14    
P90 TTFT (ms):                           454.69    
P95 TTFT (ms):                           455.02    
P99 TTFT (ms):                           455.28    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          13.30     
Median TPOT (ms):                        13.30     
P90 TPOT (ms):                           13.30     
P95 TPOT (ms):                           13.30     
P99 TPOT (ms):                           13.30     
---------------Inter-Token Latency----------------
Mean ITL (ms):                           13.30     
Median ITL (ms):                         13.30     
P90 ITL (ms):                            13.32     
P95 ITL (ms):                            13.33     
P99 ITL (ms):                            13.41     
Max ITL (ms):                            16.84     
==================================================

----- stderr -----
/sgl-workspace/sglang/python/sglang/bench_serving.py:13: FutureWarning: `sglang.bench_serving` is deprecated and will be removed in a future release; use `sglang.benchmark.serving` instead (e.g. `python -m sglang.benchmark.serving`).
  warnings.warn(

  0%|          | 0/4 [00:00<?, ?it/s]
 25%|██▌       | 1/4 [00:14<00:42, 14.06s/it]
 50%|█████     | 2/4 [00:28<00:28, 14.06s/it]
 75%|███████▌  | 3/4 [00:42<00:14, 14.06s/it]
100%|██████████| 4/4 [00:56<00:00, 14.06s/it]
100%|██████████| 4/4 [00:56<00:00, 14.06s/it]